** Prefixes

#+name: lob-ingest-file
#+BEGIN_SRC emacs-lisp :var file="prefixes.org"
(org-babel-lob-ingest file);
#+END_SRC

#+RESULTS: lob-ingest-file
: 0


#+CALL: lob-ingest-file(file="~/rp-ucd-harvest/lib/prefixes.org")

#+RESULTS:
: 2

*** Grant Links Feed

    What are our roles again?
#+begin_src sparql :noweb yes :url http://localhost:8081/private/sparql
  <<prefixes>>
  select ?role ?label
  where {
    ?role a vivo:ResearcherRole;
          rdfs:label ?label;
          ucdrp:abbrev ?abbrev;
            .
  }
#+end_src

#+RESULTS:
| role                                                               | label                     |
|--------------------------------------------------------------------+---------------------------|
| http://experts.ucdavis.edu/schema#GrantOtherRole                   | Researcher                |
| http://experts.ucdavis.edu/schema#GrantProjectLeaderRole           | Project Leader            |
| http://experts.ucdavis.edu/schema#GrantCoPrincipalInvestigatorRole | Co-Principal Investigator |
| http://experts.ucdavis.edu/schema#GrantProgramDirectorRole         | Program Director          |
| http://experts.ucdavis.edu/schema#GrantCoreLeaderRole              | Core Leader               |
| http://experts.ucdavis.edu/schema#GrantKeyPersonnelRole            | Key Personnel             |
| http://experts.ucdavis.edu/schema#GrantPrincipalInvestigatorRole   | Principal Investigator    |

This is a quick review of the people in our system

#+begin_src sparql :noweb yes :url http://localhost:8081/private/sparql
      <<prefixes>>
  #  select (count(*) as ?cnt) WHERE {
  select (group_concat(?cas) as ?casList) WHERE {
    select ?cas
      where {
        SERVICE <http://fuseki:3030/experts/sparql> {
          ?person a ucdrp:person;
                  ucdrp:casId ?cas;
                  .
        }
      } order by ?cas
  }
#+end_src


 //#+begin_src sparql :noweb yes :format raw :wrap SRC ttl :url http://localhost:8081/private/sparql :var limit="10"
#+begin_src sparql :noweb yes :url http://localhost:8081/private/sparql :var limit="100000" :results file :file links.csv
              <<prefixes>>
      select ?category-1 ?id-1 ?category-2 ?id-2 ?link-type-id ("TRUE" as ?visible)
      WHERE {
        # Here we select the grants that interest us
        {
          select ?grant where {
            {
              SERVICE <http://fuseki:3030/experts/sparql> {
                select distinct ?expert WHERE {
                  ?expert a ucdrp:person.
                }
              }
            }
            ?grant a vivo:Grant;
                   vivo:relates ?relates;
                   .
            ?relates a ucdrp:GrantPrincipalInvestigatorRole;
                     obo:RO_000052 ?expert;
                   }
        }

        {
          ?grant vivo:relates ?relates.
          ?relates a ?role;
                  obo:RO_000052/ucdrp:casId ?person;
                  obo:RO_000052/ucdrp:employeeId ?employeeid
                  .
          bind("user" as ?category-1)
          bind("grant" as ?category-2)
          bind(?employeeid as ?id-1)
          #      bind(concat(?person,"@ucdavis.edu") as ?id-1)
          bind(replace(str(?grant),str(grant:),"davis-") as ?id-2)

          VALUES (?role ?link-type-id ?e-role) {
            (ucdrp:GrantAccountManagerRole "183" "Researcher on" )
            (ucdrp:GrantOtherRole "183" "Researcher on" )
            (ucdrp:GrantProjectLeaderRole "118" "Project Lead of")
            (ucdrp:GrantCoPrincipalInvestigatorRole "116" "Co-PI of")
            (ucdrp:GrantProgramDirectorRole "137" "Program Director of")
            (ucdrp:GrantCoreLeaderRole "119" "Co leader on")
            (ucdrp:GrantKeyPersonnelRole "97" "Senior personal of")
            (ucdrp:GrantPrincipalInvestigatorRole "43" "Primary investagor for")
          }
        } UNION {
          ?grant vivo:relates ?relates.
          ?relates a ?role;
                   obo:RO_000052/ucdrp:casId ?person;
                  obo:RO_000052/ucdrp:employeeId ?employeeid
                   .
          bind("grant" as ?category-1)
          bind("user" as ?category-2)
          bind(replace(str(?grant),str(grant:),"davis-") as ?id-1)
          bind(?employeeid as ?id-2)
    #      bind(concat(?person,"@ucdavis.edu") as ?id-2)
          bind("17" as ?link-type-id)
          bind("Funder of" as ?e-role)
        }
      } limit ?limit
#+end_src

#+RESULTS:
[[file:links.csv]]



